cask_args appdir: '/Applications'

tap 'Homebrew/bundle'
tap 'rawnly/tap'
tap 'github/gh'
tap 'rs/tap'
tap 'hashicorp/tap'
tap 'teamokla/speedtest'
tap 'clementtsang/bottom'
tap 'homebrew/cask' || true
tap 'planetscale/tap'


brew 'stripe'
brew 'thefuck'
brew 'tldr'
brew 'wallpaper'
brew 'zplug'
brew 'zoxide'
brew 'zsh-completions'
brew 'zsh-vi-mode'
brew 'readline'
brew 'slides'
brew 'mysql'
brew 'lazygit'
brew 'doctl'
brew 'doppler'
brew 'helix'
brew 'htop'
brew 'glow'
brew 'git-flow'
brew 'speedtest'
brew 'neovide'
brew 'tree'
brew 'pscale'
brew 'git-add-commit'
brew 'git-select'
brew 'aalias'
brew 'tokei'
brew 'httpie'
brew 'curlie'
brew 'bat'
brew 'bash' # bash 4
brew 'fzf'
brew 'ripgrep'
brew 'tmux'
brew 'bottom'
brew 'neovim'
brew 'difftastic'
brew 'exa'
brew 'htop'
brew 'rustup'
brew 'node'
brew 'task'
brew 'qlcolorcode'
brew 'qlstephen'
brew 'qlimagesize'
brew 'prism'
brew 'gh'
brew 'zsh-sytax-highlighting'
brew 'mas'
brew 'fd'


cask 'alacritty'
cask 'spotify'
cask 'setapp'
cask 'slack'
cask 'iterm2'
cask '1password'
cask 'visual-studio-code'
cask 'firefox'
cask '4k-stogram'
cask '4k-youtube-to-mp3'
cask 'linear'
cask 'spark'
cask 'blender'
cask 'bartender'
cask 'clipy'
cask 'blender'
cask 'altair-graphql-client'
cask 'dbgin'
cask 'insomnia'
cask 'monitorcontrol'
cask 'notion'
cask 'raycast'
cask 'rocket'
cask 'arc'
cask 'balenaetcher'
cask 'airbuddy'
cask 'apparency'
cask 'jetbrains-toolbox'
cask 'goland'
cask 'battery-buddy'


mas 1502839586 # Hand Mirror
mas 1504940162 # RocketSim
mas 775737590 # iA
mas 441258766 # Magnet
mas 1470584107 # Dato
mas 1294126402 # HEIC

